import { Home } from './components/home/home.component';

export const routing = ($stateProvider: angular.ui.IStateProvider) => {
  'ngInject';
  $stateProvider.state({
    name: 'home',
    url: '/',
    component: Home.selector,
    data: {
      meta: {
        canonical: `${process.env.SITE_URL}`,
        title: 'کشینه | بهینه ترین خرید آنلاین',
        keyword:
          'فروشگاه اینترنتی, خرید آنلاین, خرید اینترنتی, کامپیوتر, موبایل, تبلت, لپ تاپ, لوازم جانبی, کامپیوتر, گوشی, کتاب, لوازم اداری, لوازم خانگی, عطر و ادکلن, لوازم اداری, پت, غذای سگ, استخدام, تجهیزات سفر, سوپر مارکت, بلیط هواپیما, هتل, ترجمه, فروش اینترنتی, کشینه, کش بک, افیلیت مارکتینگ, فروشگاه آنلاین, کد تخفیف, بامیلو, گل, cashineh',
        description:
          'با خرید اینترنتی به واسطه کشینه از بین صدها فروشگاه آنلاین درصدی از پول خود را پس بگیرید! با کشینه می توانید از آفرها، کوپن های تخفیف، حراجی ها، ووچرها و هرچه که به شما کمک می کند ارزانتر خرید کنید بهره مند شوید.'
      }
    }
  });
};
